## 라이브러리 선언

In [2]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine
import sqlalchemy

## DB Connect

In [3]:
#engine = create_engine("mysql+pymysql://root:"+"mariadb"+"@127.0.0.1:3307/ai_test?charset=utf8", encoding='utf-8')
engine = create_engine("mysql+pymysql://root:"+"mariadb"+"@10.184.9.128:3307/ai_test?charset=utf8", encoding='utf-8')

# Open database connection
db = pymysql.connect(host='10.184.9.128', port=3307, user='root', passwd='mariadb', db='ai_test',charset='utf8',autocommit=True)

conn = engine.connect()

# Connection 으로부터 Cursor 생성
curs = db.cursor()
 
# Connection 닫기
# conn.close()

## Data Load

In [6]:
featureData = pd.read_csv("./dataset/OT_F_DATA_V4.csv")

In [7]:
#featureData.to_sql(name='TB_TEST_04', con=engine, if_exists='append', index=False)
featureData.to_sql(name='TB_ORG_DATA_01', con=engine, if_exists='append', index=False)

C:\Users\User\Anaconda3\lib\site-packages\pandas\io\sql.py:1336: UserWarning: The provided table name 'TB_ORG_DATA_01' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

In [33]:
featureData.head()

,USE_YYMM,CTRT_ID,PROD_ID,PROD_NM,USE_VOICE,USE_OVER_VOICE_AMT,USE_SMS,USE_OVER_SMS_AMT,USE_DATA,USE_OVER_DATA_AMT,...,CUST_ID,ACT_DTTM,ORDER_TP,PROMOTION_NM,CUST_TP,SEX_TP,BIRTH_DT,AGE,SEX_NUM,TOTAL_AMT
0,201901,C013600189,PDB0000160,헬로LTE 표준,34,3702.6,316,7230,0,0.0,...,C003561187,20171023162349,103,S1766924,A,M,20090717,10,1,19932
1,201901,C013896915,PDB0000160,헬로LTE 표준,2,268.2,0,0,0,0.0,...,C003789397,20180908132117,103,S1805493,A,F,19370720,82,2,9268
2,201901,C013819537,PDB0000160,헬로LTE 표준,107,11516.4,0,0,0,0.0,...,C003730440,20180612142002,103,S1892823,A,F,19600215,59,2,20516
3,201901,C013934795,PDB0000160,헬로LTE 표준,119,12879.0,3,60,0,0.0,...,C003817445,20181027164831,103,S1811227,A,M,19840610,35,1,21939
4,201901,C013753524,PDB0000160,헬로LTE 표준,0,0.0,36,720,0,0.0,...,C003680357,20180326114812,103,S1883277,A,F,19740521,45,2,9720

## Data Select

In [36]:
# # SQL문 실행
# sql = "SELECT * from TB_TEST_02;"
# curs.execute(sql)

sql = "SELECT * FROM TB_TEST_03 WHERE CTRT_ID = %s;"
val = ("C013600198")
curs.execute(sql, val)

sellectData3 = curs.fetchone()
print(sellectData3)

('201903', 'C013600198', 21009)

In [37]:
sellectData3 = pd.read_sql_query('SELECT * from TB_TEST_03', conn) 

sellectData3.head()

  USE_YYMM     CTRT_ID  TOTAL_AMT
0   201901  C013600189      10000
1   201902  C013600190      20000
2   201903  C013600191      30000
3   201902  C013600192      40000
4   201902  C013600199      21000

## Data Insert

In [44]:
sql = "INSERT INTO TB_TEST_02 (USE_YYMM, CTRT_ID, TOTAL_AMT) VALUES (%s, %s, %s)"
val = ("201911", "C013600200" , "2100")
curs.execute(sql, val)

db.commit()

In [45]:
# DB 테이블을 읽어 Data Frame 변수에 저장하기
sellectData = pd.read_sql_query('SELECT * from TB_TEST_02', db) 

sellectData

    USE_YYMM     CTRT_ID  TOTAL_AMT
0     201901  C013600189      10000
1     201902  C013600190      20000
2     201903  C013600191      30000
3     201902  C013600192      40000
4     201902  C013600199      21000
5     201902  C013600199      21000
6     201911  C013600198      21009
7     201903  C013600198      21009
8     201903  C013600200       2100
9     201903  C013600200       2100
10    201911  C013600200       2100
11    201911  C013600200       2100

## Data Update

In [46]:
sql = "UPDATE TB_TEST_02 SET USE_YYMM = %s WHERE CTRT_ID = %s;"
val = ("201930", "C013600198")
curs.execute(sql, val)

db.commit()

In [9]:
sql = "DELETE FROM TB_RUN_HISTORY"
# val = ("1")
curs.execute(sql)

db.commit()

In [47]:
sellectData = pd.read_sql_query('SELECT * from TB_TEST_02', db) 

sellectData

    USE_YYMM     CTRT_ID  TOTAL_AMT
0     201901  C013600189      10000
1     201902  C013600190      20000
2     201903  C013600191      30000
3     201902  C013600192      40000
4     201902  C013600199      21000
5     201902  C013600199      21000
6     201930  C013600198      21009
7     201930  C013600198      21009
8     201903  C013600200       2100
9     201903  C013600200       2100
10    201911  C013600200       2100
11    201911  C013600200       2100

In [48]:
# Connection 닫기
conn.close()